# Access the Dataframe

In [1]:
import numpy as np
import pandas as pd

data = np.random.random((3, 4))
pd.DataFrame(data, index=['A', 'B', 'C'], columns=np.arange(1,5))

          1         2         3         4
A  0.603454  0.094582  0.976804  0.496668
B  0.652625  0.535556  0.860523  0.257480
C  0.550336  0.760369  0.349641  0.828996

- index and columns are default to be set np.arange(length of index/columns).

In [2]:
df = pd.DataFrame(np.random.randn(4, 2), index = ['a', 'b', 'c', 'd'], columns = ['I', 'II'])
print(df[:2])

          I        II
a  1.746296 -0.963512
b  1.442149 -0.952958

- Select the first two rows of df.

In [3]:
df.loc[['a', 'c'], 'II']

a   -0.963512
c    0.082671
Name: II, dtype: float64

In [4]:
df.iloc[-2:, 0]

c   -0.873753
d    0.243729
Name: I, dtype: float64

- `.loc[]` and `.loci[]` are used to select rows. The former one uses `index` and `columns` name, while the latter one uses numbers.

In [7]:
print(df['II'])
print(df.II)

a   -0.963512
b   -0.952958
c    0.082671
d   -1.586826
Name: II, dtype: float64
a   -0.963512
b   -0.952958
c    0.082671
d   -1.586826
Name: II, dtype: float64

- Another direct way to select a column

In [8]:
df['II'] = 0
print(df)

          I  II
a  1.746296   0
b  1.442149   0
c -0.873753   0
d  0.243729   0

In [11]:
dnp = np.arange(4)
df['II'] = dnp
print(df)

          I  II
a  1.746296   0
b  1.442149   1
c -0.873753   2
d  0.243729   3

In [13]:
dnp = np.arange(4).reshape(2, 2)
df.loc[['a', 'c'], ['I', 'II']] = dnp
print(df)

          I  II
a  0.000000   1
b  1.442149   1
c  2.000000   3
d  0.243729   3

- The subset-value settings in pandas is quite flexible! The refereing method to access value can all be used to set subsets as well.

# Analyzing Data

- Because the primary pandas data structures are subclasses of the ndarray, they are valid input
to most NumPy functions

In [15]:
x = pd.DataFrame(np.arange(1, 5), index=['a', 'b', 'c', 'd'])
y = pd.DataFrame(np.arange(1, 6), index=['a', 'b', 'd', 'e', 'f'])

print(x ** 2)

    0
a   1
b   4
c   9
d  16

In [16]:
z = x + y
print(z)

     0
a  2.0
b  4.0
c  NaN
d  7.0
e  NaN
f  NaN

In [17]:
print(np.log(z))

          0
a  0.693147
b  1.386294
c       NaN
d  1.945910
e       NaN
f       NaN

In [19]:
df = pd.DataFrame(np.random.randn(4,2), index=['a', 'b', 'c', 'd'], columns=['I', 'II'])
print(df)

          I        II
a  1.144014  0.605188
b  0.285863  0.550379
c -0.223237 -1.923582
d -0.780486 -1.986754

In [20]:
print(df.transpose())

           a         b         c         d
I   1.144014  0.285863 -0.223237 -0.780486
II  0.605188  0.550379 -1.923582 -1.986754

In [23]:
print(df.reindex(index=['a', 'c'], columns=['II', 'I']))

         II         I
a  0.605188  1.144014
c -1.923582 -0.223237

In [24]:
print(df.sort_values('II', ascending=False))

          I        II
a  1.144014  0.605188
b  0.285863  0.550379
c -0.223237 -1.923582
d -0.780486 -1.986754

- Since the missing value in pandas dataframe will be set to NaN, so it's easy to deal with the missing data using panda.

In [25]:
x = pd.Series(np.arange(5))
y = pd.Series(np.random.randn(5))
x.iloc[3] = np.nan
print(x + y)

0   -0.298785
1   -0.412571
2    3.048275
3         NaN
4    2.736434
dtype: float64

In [26]:
print((x + y).dropna()) # Using dropna()

0   -0.298785
1   -0.412571
2    3.048275
4    2.736434
dtype: float64

In [27]:
print(x.fillna(100) + y) # Using fillna() to fill all Nan with a value

0     -0.298785
1     -0.412571
2      3.048275
3    100.915574
4      2.736434
dtype: float64

In [28]:
df = pd.read_csv("RiskFactorsData.csv")
print(df.head(10))

   Unnamed: 0  income  smoke  cholesterol  bmi  exercise  attack  bp  angina  \
0           0       6      2            2    4         2       2   1       2
1           1       2      2            1    3         1       2   1       2
2           2       6      1            2    3         1       2   3       2
3           3       2      1            2    4         2       2   1       2
4           4       5      1            2    3         2       2   3       2
5           5       8      1            2    3         1       2   3       2
6           6       6      2            2    2         1       2   1       2
7           7       6      2            1    3         1       2   3       2
8           8       7      1            2    2         1       2   3       2
9           9       3      2            1    4         2       2   2       2

   stroke  diabetes  long_sit  stay_up
0       2         3         1        2
1       2         3         1        2
2       2         3         1        2
3       2         1         2        2
4       2         3         2        1
5       2         3         1        1
6       2         3         2        2
7       2         3         1        1
8       2         3         2        2
9       2         3         1        1

# SQL-like Operations

In [30]:
name = ['Mylan', 'Regan', 'Justin', 'Jess', 'Jason', 'Remi', 'Matt', 'Alexander', 'JeanMarie']
sex = ['M', 'F', 'M', 'F', 'M', 'F', 'M', 'M', 'F']
age = [20, 21, 18, 22, 19, 20, 20, 19, 20]
rank = ['Sp', 'Se', 'Fr', 'Se', 'Sp', 'J', 'J', 'J', 'Se']
ID = range(9)
aid = ['y', 'n', 'n', 'y', 'n', 'n', 'n', 'y', 'n']
GPA = [3.8, 3.5, 3.0, 3.9, 2.8, 2.9, 3.8, 3.4, 3.7]
mathID = [0, 1, 5, 6, 3]
mathGd = [4.0, 3.0, 3.5, 3.0, 4.0]
major = ['y', 'n', 'y', 'n', 'n']
studentInfo = pd.DataFrame({'ID': ID, 'Name': name, 'Sex': sex, 'Age': age,'Class': rank})
otherInfo = pd.DataFrame({'ID': ID, 'GPA': GPA, 'Financial_Aid': aid})
mathInfo = pd.DataFrame({'ID': mathID, 'Grade': mathGd, 'Math_Major': major})

In [31]:
mathInfo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          5 non-null      int64
 1   Grade       5 non-null      float64
 2   Math_Major  5 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

In [32]:
mathInfo.head()

   ID  Grade Math_Major
0   0    4.0          y
1   1    3.0          n
2   5    3.5          y
3   6    3.0          n
4   3    4.0          n

In [33]:
studentInfo[['ID', 'Age']] # Use [] brackets to select specific columns or use conditions to select data

   ID  Age
0   0   20
1   1   21
2   2   18
3   3   22
4   4   19
5   5   20
6   6   20
7   7   19
8   8   20

In [35]:
otherInfo[otherInfo["Financial_Aid"] == "y"][["ID", "GPA"]]

   ID  GPA
0   0  3.8
3   3  3.9
7   7  3.4

In [36]:
studentInfo[studentInfo["Class"].isin(["J", "Sp"])]["Name"] # isin() to select the "Class" whether or not in a range

0        Mylan
4        Jason
5         Remi
6         Matt
7    Alexander
Name: Name, dtype: object

In [37]:
pd.merge(studentInfo, mathInfo, on="ID")

   ID   Name Sex  Age Class  Grade Math_Major
0   0  Mylan   M   20    Sp    4.0          y
1   1  Regan   F   21    Se    3.0          n
2   3   Jess   F   22    Se    4.0          n
3   5   Remi   F   20     J    3.5          y
4   6   Matt   M   20     J    3.0          n

In [38]:
pd.merge(otherInfo, mathInfo, on="ID", how="outer")[["GPA", "Grade"]]

   GPA  Grade
0  3.8    4.0
1  3.5    3.0
2  3.0    NaN
3  3.9    4.0
4  2.8    NaN
5  2.9    3.5
6  3.8    3.0
7  3.4    NaN
8  3.7    NaN

Four kinds of merge (Base on "on"-param):
- inner: choose those rows that exists in both 
- outer: keep all from both
- left: keep all from df1, match rows from df2
- right: keep all from df2, match rows from df1

In [39]:
x = pd.DataFrame({'A': [1, 2]})
y = pd.DataFrame({'B': ['a', 'b', 'c']})
pd.merge(x, y, how="cross") # Use "cross" to get the Cartesian product of two df

   A  B
0  1  a
1  1  b
2  1  c
3  2  a
4  2  b
5  2  c